# install stow to set configs from .dotfiles
brew "stow"

# install latest shell and NeoVim
brew "fish"
brew "nvim"

brew "whalebrew" # docker images as commands

# search engine
brew "ripgrep"
brew "rga"
# fuzzy search
brew "fzf"
# better git diffs
brew "git-delta"
# task management (taskwarrior)
brew "task"
brew "timewarrior"
# various languages versions management
brew "mise"
# YAML, JSON and XML processor like jq
brew "yq"
# tools usage helper
brew "tealdeer"
brew "howdoi"
# search and remove duplicate files
brew "jdupes"
# record terminal as gif
brew "vhs"
# install download accelerator
brew "axel"
# install imagemagick
brew "imagemagick"
# better df
brew "dysk"
# calendars
brew "khal"
brew "vdirsyncer"

# OS tools 
brew "midnight-commander"
brew "yazi"
# cd replacement
brew "zoxide"
# working with media from CLI
brew "ffmpeg"
# universal archive extractor
brew "dtrx"
# cURL
brew "curl"
# XH 
brew "xh"
# better cat
brew "bat"
# modern top
brew "btop"
brew "bottom" # btm
# file finder
brew "ffind"
# du on steroids
brew "dust"
# prompt on steroids 
brew "starship"
# clean up project
brew "kondo"
# temporary used
# Control Android device
# brew "scrcpy"

# home stuff
brew "pdftk-java"

# work stuff
# benchmarking
brew "hyperfine"
# AWS CLI
brew "awscli"
# k8s CLI
brew "kubectl"
# select k8s context interactively
brew "kubectx"
# show and keep current context instead of changing it globally
tap "jlesquembre/kubeprompt", "https://github.com/jlesquembre/kubeprompt/"
brew "kubeprompt"
# GitHub CLI
brew "gh"
# Use SQL for file system queries
brew "fselect"
# CLI task runner definded by markdown file
brew "mask"
# Terminal presentations on markdown
brew "presenterm"
# cli to tork with serial ports
brew "bootterm"

# EXPERIMENTAL
# ------------

# terminal note taking
# brew "nb"

# pass to manage secrets in files instead of 1Password
brew "pass"
# brew "browserpass"

# Hackernews in terminal with cfx
brew "circumflex"

# modern file tree
brew "erdtree"

# install lua (to install magic rock for image support in nvim)
# brew "lua@5.1"
brew "luarocks"
# luarocks install magick --tree /home/linuxbrew/.linuxbrew/
# luarocks config lua_version 5.1

brew "entr"
#brew "rename"

brew "parallel"
brew "lazydocker"
brew "kind"
