# install stow to set configs from .dotfiles
brew "stow"

# install latest shell and NeoVim
brew "fish"
brew "nvim"

brew "whalebrew" # docker images as commands

# search engine
brew "ripgrep"
# fuzzy search
brew "fzf"
# better git diffs
brew "git-delta"
# task management (taskwarrior)
brew "task"
# various languages versions management
brew "mise"
# YAML, JSON and XML processor like jq
brew "yq"
# tools usage helper
brew "tldr"
brew "howdoi"
# search and remove duplicate files
brew "jdupes"
# record terminal as gif
brew "vhs"
# install download accelerator
brew "axel"
# install imagemagick
brew "imagemagick"

# OS tools 
brew "midnight-commander"
# cd replacement
brew "zoxide"
# working with media from CLI
brew "ffmpeg"
# universal archive extractor
brew "dtrx"
# cURL
brew "curl"
# better cat
brew "bat"
# modern top
brew "btop"

# temporary used
# Control Android device
# brew "scrcpy"

# home stuff
brew "pdftk-java"

# work stuff
brew "awscli"
brew "kubectl"
brew "kubectx"
tap "jlesquembre/kubeprompt", "https://github.com/jlesquembre/kubeprompt/"
brew "kubeprompt"

# EXPERIMENTAL
# ------------

# terminal note taking
# brew "nb"

# pass to manage secrets in files instead of 1Password
brew "pass"
# brew "browserpass"

# Hackernews in terminal with cfx
brew "circumflex"

# modern file tree
brew "erdtree"

# install lua (to install magic rock for image support in nvim)
# brew "lua@5.1"
brew "luarocks"
# luarocks install magick --tree /home/linuxbrew/.linuxbrew/
# luarocks config lua_version 5.1

brew "entr"
brew "rename"

brew "parallel"
brew "lazydocker"
brew "kind"
