jorgebucaran/fisher
jorgebucaran/nvm.fish
daenney/pyenv
patrickf1/fzf.fish
franciscolourenco/done
ferroman/theme-bfrankovskyi
edc/bass
takaishi/fish-goenv
rstacruz/fish-asdf
/home/bf/p/theme-bfrankovskyi
/home/bf/p/e/theme-bfrankovskyi
